---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.PresetInitialColor
source: html/adaab54b-d0ef-33e3-9d60-b6e1d9a29ff3.htm
---
# PresetInitialColor Properties

Specifies whether the .NET object represents a valid Revit entity.